app/controllers/students_controller.rb

    def create
    @student = Student.new(params.require(:student).permit(:first_name, :last_name))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Matt"], ["last_name", "b"], ["created_at", "2021-04-26 20:20:28.638510"], ["updated_at", "2021-04-26 20:20:28.638510"]]